//**プログラムヘッダ***************************************************************
//	プログラム概要	:	メインシーンクラス
//*********************************************************************************
using UnityEngine;
using System.Collections;

public class CMain : CScene
{
	// --変数宣言--


	//**関数***************************************************************************
	//	概要	:	変数初期化	:	外部とはアクセスしないこと
	//*********************************************************************************
	void Awake()
	{

	}


	//**関数***************************************************************************
	//	概要	:	初期化処理
	//*********************************************************************************
	public override bool Initialize()
	{
		// 使用するオブジェクト生成


		return base.Initialize();
	}


	//**関数***************************************************************************
	//	概要	:	更新処理
	//*********************************************************************************
	void Update()
	{
		if (CManager.Instance.GetInput().GetKeyTrigger(KeyCode.Return))
			CManager.Instance.GetSceneManager().SetNextScene(CSceneManager.eSceneID.TITLE, CChanging.eChangeType.BLACK_FEAD);
	}
}
