//**プログラムヘッダ***************************************************************
//	プログラム概要	:	パネルセット時エフェクト
//*********************************************************************************
using UnityEngine;
using System.Collections;

public class CSetEffect : MonoBehaviour {

	protected ParticleSystem m_System;

	//**関数***************************************************************************
	//	概要	:	初期処理
	//*********************************************************************************
	void Awake()
	{
		m_System = gameObject.GetComponent<ParticleSystem>();
	}

	//**関数***************************************************************************
	//	概要	:	エフェクト生成
	//*********************************************************************************
	public void Play()
	{
		m_System.Play();
	}

}
